tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'osx-cross/avr'
cask_args appdir: "/Applications"

brew 'bash', link: true
brew 'bash-completion'
brew 'cmake'
brew 'ctags'
# brew 'dfu-programmer'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'fzf'
brew 'git', args: ['with-openssl']
brew 'gnu-sed'
brew 'openssh'
brew 'openssl'
brew 'go'
brew 'gpg'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'telnet'
brew 'tmux'
brew 'tree'
# brew 'unrar'
brew 'vim'
brew 'watch'
brew 'wget'

# completions
brew 'brew-cask-completion'
brew 'pip-completion'
brew 'vagrant-completion'

cask 'teensy', args: { appdir: "~/Applications" }
brew 'osx-cross/avr/avr-binutils'
brew 'osx-cross/avr/avr-gcc'

# ntfs...
cask 'osxfuse'
brew 'ntfs-3g'

cask 'aerial'
cask 'caffeine', args: { appdir: "~/Applications" }
cask 'caprine', args: { appdir: "~/Applications" }
cask 'disk-inventory-x', args: { appdir: "~/Applications" }
cask 'discord', args: { appdir: "~/Applications" }
cask 'docker'
cask 'dropbox', args: { appdir: "~/Applications" }
cask 'firefox'
cask 'flux', args: { appdir: "~/Applications" }
cask 'freesmug-chromium'
cask 'google-backup-and-sync', args: { appdir: "~/Applications" }
cask 'keepassxc', args: { appdir: "~/Applications" }
cask 'marshallofsound-google-play-music-player'
cask 'itsycal', args: { appdir: "~/Applications" }
cask 'caskroom/versions/microsoft-remote-desktop-beta', args: { appdir: "~/Applications" }
cask 'owncloud'
cask 'p4merge'
cask 'skype'
cask 'signal', args: { appdir: "~/Applications" }
cask 'spectacle', args: { appdir: "~/Applications" }
cask 'steam', args: { appdir: "~/Applications" }
cask 'thunderbird', args: { appdir: "~/Applications" }
cask 'tunnelblick'
cask 'vagrant'
cask 'vlc', args: { appdir: "~/Applications" }
# cask 'vmware-fusion8', args: { appdir: "~/Applications" }
cask 'yakyak', args: { appdir: "~/Applications" }
cask 'ynab', args: { appdir: "~/Applications" }
