tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'osx-cross/avr'
cask_args appdir: "/Applications"

brew 'bash', link: true
brew 'bandwhich'
brew 'bat'
brew 'coreutils'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'fd'
brew 'fzf'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'jq'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'telnet'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'

# dev tools
brew 'cmake'
brew 'go'
brew 'python'
brew 'python3'
brew 'pipenv'
brew 'shellcheck'

# completions
brew 'bash-completion@2'
brew 'brew-cask-completion'
brew 'pip-completion'
brew 'vagrant-completion'

# stuff for ergodox
cask 'teensy', args: { appdir: "~/Applications" }
brew 'osx-cross/avr/avr-binutils'
brew 'osx-cross/avr/avr-gcc'

# ntfs...
cask 'osxfuse'
brew 'ntfs-3g'

cask 'aerial'
cask 'appcleaner'
cask 'caprine', args: { appdir: "~/Applications" }
cask 'discord', args: { appdir: "~/Applications" }
cask 'disk-inventory-x', args: { appdir: "~/Applications" }
cask 'docker'
cask 'dropbox', args: { appdir: "~/Applications" }
cask 'firefox'
cask 'flux', args: { appdir: "~/Applications" }
cask 'google-backup-and-sync', args: { appdir: "~/Applications" }
cask 'itsycal', args: { appdir: "~/Applications" }
cask 'keepassxc', args: { appdir: "~/Applications" }
cask 'keepingyouawake', args: { appdir: "~/Applications" }
cask 'marshallofsound-google-play-music-player'
cask 'caskroom/versions/microsoft-remote-desktop-beta', args: { appdir: "~/Applications" }
cask 'owncloud'
cask 'p4v'
cask 'signal', args: { appdir: "~/Applications" }
cask 'spectacle', args: { appdir: "~/Applications" }
cask 'steam', args: { appdir: "~/Applications" }
cask 'tunnelblick'
cask 'vagrant'
cask 'vlc', args: { appdir: "~/Applications" }
# cask 'vmware-fusion8', args: { appdir: "~/Applications" }
cask 'yakyak', args: { appdir: "~/Applications" }
cask 'ynab', args: { appdir: "~/Applications" }
